In [38]:
import numpy as np
import pandas as pd
from keras.utils import to_categorical

In [39]:
train_data = pd.read_csv("input/train.csv")
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
test_data = pd.read_csv("input/test.csv")
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [41]:
train_data.Sex.unique()

array(['male', 'female'], dtype=object)

In [42]:
test_data.Sex.unique()

array(['male', 'female'], dtype=object)

In [43]:
train_data["Sex"] = train_data["Sex"].replace(["male", "female"],[-1, 1])
test_data["Sex"] = test_data["Sex"].replace(["male", "female"],[-1, 1])

In [44]:
train_data["Name"] = train_data["Name"].str.lower()
test_data["Name"] = test_data["Name"].str.lower()

In [45]:
train_data.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [46]:
test_data.Embarked.unique()

array(['Q', 'S', 'C'], dtype=object)

In [47]:
embarked_types = ['Q', 'S', 'C']
train_data = train_data.join(pd.get_dummies(train_data.Embarked, prefix = 'Embarked'))
train_data.drop('Embarked', inplace = True, axis = 1)

test_data = test_data.join(pd.get_dummies(test_data.Embarked, prefix = 'Embarked'))
test_data.drop('Embarked', inplace = True, axis = 1)

In [48]:
train_data['Name'] = train_data['Name'].str.extract('.*, ([A-Za-z]+)\..*', expand = False).str.strip()
test_data['Name'] = test_data['Name'].str.extract('.*, ([A-Za-z]+)\..*', expand = False).str.strip()

In [49]:
train_data.Name.unique()

array(['mr', 'mrs', 'miss', 'master', 'don', 'rev', 'dr', 'mme', 'ms',
       'major', 'lady', 'sir', 'mlle', 'col', 'capt', nan, 'jonkheer'],
      dtype=object)

In [50]:
test_data.Name.unique()

array(['mr', 'mrs', 'miss', 'master', 'ms', 'col', 'rev', 'dr', 'dona'],
      dtype=object)

In [51]:
title_types = ['mr', 'mrs', 'miss', 'master', 'don', 'rev', 'dr', 'mme', 'ms',
       'major', 'lady', 'sir', 'mlle', 'col', 'capt', 'jonkheer', 'ms', 'rev', 'dr', 'dona']
train_data = train_data.join(pd.get_dummies(train_data.Name, prefix = 'Title'))
train_data.drop('Name', inplace = True, axis = 1)

test_data = test_data.join(pd.get_dummies(test_data.Name, prefix = 'Title'))
test_data.drop('Name', inplace = True, axis = 1)

In [52]:
train_data['Age'] = train_data['Age'].fillna(0.0) / 100.0
test_data['Age'] = test_data['Age'].fillna(0.0) / 100.0

In [53]:
train_data

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Title_major,Title_master,Title_miss,Title_mlle,Title_mme,Title_mr,Title_mrs,Title_ms,Title_rev,Title_sir
0,1,0,3,-1,0.22,1,0,A/5 21171,7.2500,NaN,...,0,0,0,0,0,1,0,0,0,0
1,2,1,1,1,0.38,1,0,PC 17599,71.2833,C85,...,0,0,0,0,0,0,1,0,0,0
2,3,1,3,1,0.26,0,0,STON/O2. 3101282,7.9250,NaN,...,0,0,1,0,0,0,0,0,0,0
3,4,1,1,1,0.35,1,0,113803,53.1000,C123,...,0,0,0,0,0,0,1,0,0,0
4,5,0,3,-1,0.35,0,0,373450,8.0500,NaN,...,0,0,0,0,0,1,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,-1,0.27,0,0,211536,13.0000,NaN,...,0,0,0,0,0,0,0,0,1,0
887,888,1,1,1,0.19,0,0,112053,30.0000,B42,...,0,0,1,0,0,0,0,0,0,0
888,889,0,3,1,0.00,1,2,W./C. 6607,23.4500,NaN,...,0,0,1,0,0,0,0,0,0,0
889,890,1,1,-1,0.26,0,0,111369,30.0000,C148,...,0,0,0,0,0,1,0,0,0,0
890,891,0,3,-1,0.32,0,0,370376,7.7500,NaN,...,0,0,0,0,0,1,0,0,0,0

In [54]:
test_data

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,...,Embarked_S,Title_col,Title_dona,Title_dr,Title_master,Title_miss,Title_mr,Title_mrs,Title_ms,Title_rev
0,892,3,-1,0.345,0,0,330911,7.8292,NaN,0,...,0,0,0,0,0,0,1,0,0,0
1,893,3,1,0.470,1,0,363272,7.0000,NaN,0,...,1,0,0,0,0,0,0,1,0,0
2,894,2,-1,0.620,0,0,240276,9.6875,NaN,0,...,0,0,0,0,0,0,1,0,0,0
3,895,3,-1,0.270,0,0,315154,8.6625,NaN,0,...,1,0,0,0,0,0,1,0,0,0
4,896,3,1,0.220,1,1,3101298,12.2875,NaN,0,...,1,0,0,0,0,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,-1,0.000,0,0,A.5. 3236,8.0500,NaN,0,...,1,0,0,0,0,0,1,0,0,0
414,1306,1,1,0.390,0,0,PC 17758,108.9000,C105,1,...,0,0,1,0,0,0,0,0,0,0
415,1307,3,-1,0.385,0,0,SOTON/O.Q. 3101262,7.2500,NaN,0,...,1,0,0,0,0,0,1,0,0,0
416,1308,3,-1,0.000,0,0,359309,8.0500,NaN,0,...,1,0,0,0,0,0,1,0,0,0
417,1309,3,-1,0.000,1,1,2668,22.3583,NaN,1,...,0,0,0,0,1,0,0,0,0,0

In [17]:
train_data.Parch.unique()

array([0, 1, 2, 5, 3, 4, 6])

In [18]:
test_data.Parch.unique()

array([0, 1, 3, 2, 4, 6, 5, 9])